##### Import Libraries

In [1]:
import  pandas as pd
import numpy as np

##### Load Data

In [2]:
df = pd.read_csv("C:/Users/akash/Downloads/e-commerce/data/processed/ecommerce_analytics.csv")
df.shape

(1000000, 30)

In [3]:
df.head(5)

,payment_key,coustomer_key,time_key,item_key,store_key,quantity,unit_x,unit_price_x,total_price,name,...,upazila,date,hour,day,week,month,quarter,year,trans_type,bank_name
0,P026,C004510,T049189,I00177,S00307,1,ct,35.0,35.0,priya,...,ISLAMPUR,26-04-2016 17:13,17,26,4th Week,4,Q2,2016,card,Premier Bank Limited
1,P022,C008967,T041209,I00248,S00595,1,rolls,26.0,26.0,harpreet kaur,...,CANTONMENT,11-06-2018 19:08,19,11,2nd Week,6,Q2,2018,card,NRB Commercial Bank Ltd
2,P030,C007261,T03633,I00195,S00496,8,ct,12.5,100.0,sonam,...,BEGUMGANJ,19-11-2016 08:19,8,19,3rd Week,11,Q4,2016,card,Shimanto Bank Ltd
3,P032,C007048,T084631,I00131,S0086,8,ct,14.0,112.0,rekha bai,...,KAUNIA,01-02-2020 06:00,6,1,1st Week,2,Q1,2020,card,South Bangla Agriculture and Commerce Bank Lim...
4,P014,C006430,T071276,I00050,S00488,8,cans,8.0,64.0,mamta devi,...,MATIRANGA,15-07-2014 02:58,2,15,3rd Week,7,Q3,2014,card,Meghna Bank Limited

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 30 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   payment_key    1000000 non-null  object
 1   coustomer_key  1000000 non-null  object
 2   time_key       1000000 non-null  object
 3   item_key       1000000 non-null  object
 4   store_key      1000000 non-null  object
 5   quantity       1000000 non-null  int64
 6   unit_x         1000000 non-null  object
 7   unit_price_x   1000000 non-null  float64
 8   total_price    1000000 non-null  float64
 9   name           1000000 non-null  object
 10  contact_no     1000000 non-null  int64
 11  nid            1000000 non-null  int64
 12  item_name      1000000 non-null  object
 13  desc           1000000 non-null  object
 14  unit_price_y   1000000 non-null  float64
 15  man_country    1000000 non-null  object
 16  supplier       1000000 non-null  object
 17  unit_y         1000000 non-null  object
 18  division       1000000 non-null  object
 19  district       1000000 non-null  object
 20  upazila        1000000 non-null  object
 21  date           1000000 non-null  object
 22  hour           1000000 non-null  int64
 23  day            1000000 non-null  int64
 24  week           1000000 non-null  object
 25  month          1000000 non-null  int64
 26  quarter        1000000 non-null  object
 27  year           1000000 non-null  int64
 28  trans_type     1000000 non-null  object
 29  bank_name      1000000 non-null  object
dtypes: float64(3), int64(7), object(20)
memory usage: 228.9+ MB

##### Data types correction

In [19]:
df['date'] = pd.to_datetime(df['date'], dayfirst= True)
df['contact_no'] = df['contact_no'].astype(str)
df['nid'] = df['nid'].astype(str)

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 30 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   payment_key    1000000 non-null  object
 1   coustomer_key  1000000 non-null  object
 2   time_key       1000000 non-null  object
 3   item_key       1000000 non-null  object
 4   store_key      1000000 non-null  object
 5   quantity       1000000 non-null  int64
 6   unit_x         1000000 non-null  object
 7   unit_price_x   1000000 non-null  float64
 8   total_price    1000000 non-null  float64
 9   name           1000000 non-null  object
 10  contact_no     1000000 non-null  object
 11  nid            1000000 non-null  object
 12  item_name      1000000 non-null  object
 13  desc           1000000 non-null  object
 14  unit_price_y   1000000 non-null  float64
 15  man_country    1000000 non-null  object
 16  supplier       1000000 non-null  object
 17  unit_y         1000000 non-null  object
 18  division       1000000 non-null  object
 19  district       1000000 non-null  object
 20  upazila        1000000 non-null  object
 21  date           1000000 non-null  datetime64[ns]
 22  hour           1000000 non-null  int64
 23  day            1000000 non-null  int64
 24  week           1000000 non-null  object
 25  month          1000000 non-null  int64
 26  quarter        1000000 non-null  object
 27  year           1000000 non-null  int64
 28  trans_type     1000000 non-null  object
 29  bank_name      1000000 non-null  object
dtypes: datetime64[ns](1), float64(3), int64(5), object(21)
memory usage: 228.9+ MB

##### Total Revenue

In [7]:
Total_Revenue = df['total_price'].sum()

print("Total Revenue: " , Total_Revenue)

Total Revenue:  105401435.75

##### Total Transactions

In [8]:
Total_transactions = len(df)
print("Total Transactions:",Total_transactions)

Total Transactions: 1000000

##### Total Customers

In [9]:
total_customers = df['coustomer_key'].nunique()
print("Total Customers:", total_customers)

Total Customers: 9191

##### Revenue by Year

In [10]:
revenue_by_year = df.groupby('year')['total_price'].sum().sort_values(ascending = False)

print(revenue_by_year)

year
2018    15108197.25
2015    15095720.25
2020    15037190.25
2017    15015806.00
2016    14976508.25
2019    14949510.25
2014    14334731.25
2021      883772.25
Name: total_price, dtype: float64

##### Revenue by Month

In [11]:
revenue_by_year_month = df.groupby(['year', 'month'])['total_price'].sum().sort_index()
print( revenue_by_year_month)

year  month
2014  1         496549.25
      2        1122547.00
      3        1262435.75
      4        1245142.50
      5        1268770.50
                  ...
2020  9        1232639.75
      10       1319655.75
      11       1200248.75
      12       1346884.75
2021  1         883772.25
Name: total_price, Length: 85, dtype: float64

##### Revenue by Product

In [12]:
revenue_by_product = df.groupby('item_name')['total_price'].sum().sort_values(ascending=False)
print("Revenue by Product:", revenue_by_product)

Revenue by Product: item_name
Red Bull 12oz                            1305700.00
K Cups Daily Chef Columbian Supremo      1245394.00
K Cups Original Donut Shop Med. Roast    1188843.00
K Cups Dunkin Donuts Medium Roast        1109760.00
Muscle Milk Protein Shake Van. 11oz      1050924.00
                                            ...
Diet Mountain Dew 12oz cans               150842.25
Diet Gingerale 12 oz cans                 150363.00
Sprite Zero - 12 pack                     149998.50
Coffee-Mate Original Flavor Cold          139848.00
Blue Diamond Almonds Rstd, Sltd           136908.00
Name: total_price, Length: 259, dtype: float64

##### Quantity vs Revenue

In [13]:
df.groupby('item_name').agg(
    total_quantity=('quantity', 'sum'),
    total_revenue=('total_price', 'sum')
).sort_values('total_revenue', ascending=False).head(10)

                                       total_quantity  total_revenue
item_name
Red Bull 12oz                                   23740      1305700.0
K Cups Daily Chef Columbian Supremo             23498      1245394.0
K Cups Original Donut Shop Med. Roast           22431      1188843.0
K Cups Dunkin Donuts Medium Roast               23120      1109760.0
Muscle Milk Protein Shake Van. 11oz             45665      1050924.0
K Cups Folgers Lively Columbian                 22661      1042406.0
Honey Packets                                   22511      1012995.0
K Cups  Starbuck's Pike Place                  22624       995456.0
K Cups Organic Breakfast Blend                 22798       957516.0
K Cups - McCafe Premium Roast                   22783       956886.0

##### Revenue by Customer

In [14]:
df.groupby('coustomer_key')['total_price'].sum().sort_values(ascending=False).head(10)

coustomer_key
C004349    17104.50
C005316    16853.25
C000273    16645.75
C001438    16381.50
C007553    16288.75
C007415    16282.50
C008009    16194.75
C007205    16154.50
C002968    16006.50
C006902    15977.25
Name: total_price, dtype: float64

##### Customer Purchase Frequency

In [15]:
df.groupby('coustomer_key').size().sort_values(ascending=False).head(10)

coustomer_key
C006906    156
C005316    149
C008798    147
C001299    146
C002278    144
C000152    144
C002002    144
C006321    144
C003361    143
C007553    143
dtype: int64

##### Revenue by Division

In [16]:
df.groupby('division')['total_price'].sum().sort_values(ascending=False)

division
DHAKA         40764619.75
CHITTAGONG    19763595.00
RAJSHAHI      12099196.00
KHULNA        11311610.50
RANGPUR        8429836.50
BARISAL        7520343.75
SYLHET         5512234.25
Name: total_price, dtype: float64

##### Revenue by District

In [17]:
df.groupby('district')['total_price'].sum().sort_values(ascending=False).head(10)

district
DHAKA          23597621.00
CHITTAGONG      7292985.50
KHULNA          4081283.75
RAJSHAHI        3756454.50
BARISAL         2897237.75
COMILLA         2286898.25
KISHOREGONJ     1895395.50
MYMENSINGH      1885230.50
DINAJPUR        1871005.75
TANGAIL         1774650.25
Name: total_price, dtype: float64

##### Revenue by Store

In [18]:
df.groupby('store_key')['total_price'].sum().sort_values(ascending=False).head(10)

store_key
S0010     159409.00
S00601    158027.50
S00328    157692.00
S0039     157483.00
S0080     157377.50
S00357    157243.50
S00411    156979.50
S00708    156793.75
S00687    156767.75
S00266    156651.50
Name: total_price, dtype: float64